{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Д/З к лекции \"Введение в типы данных и циклы. Часть 1\"\n",
    "## Задание 1\n",
    "\n",
    "Дана переменная, в которой хранится слово из латинских букв. Напишите код, который выводит на экран:\n",
    "\n",
    "    среднюю букву, если число букв в слове нечетное;\n",
    "    две средних буквы, если число букв четное.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "t\n"
     ]
    }
   ],
   "source": [
    "word = \"testing\"\n",
    "\n",
    "a = len(word) #функция количества знаков в строке\n",
    "\n",
    "if len(word)%2 == 0: #проверяем на четность\n",
    "    print(word[int(a/2)-1],word[int(a/2)]) #делим пополам, нужная по счету буква, но т.к. индекс начинается с нуля, идет сдвиг на 1\n",
    "else:\n",
    "    print(word[int(a//2)]) #целочисленное деление, указывает на нужный индекс\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задание 2\n",
    "\n",
    "Напишите программу, которая последовательно запрашивает у пользователя числа (по одному за раз) и после первого нуля выводит сумму всех ранее введенных чисел."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите число:1\n",
      "Введите число:4\n",
      "Введите число:6\n",
      "Введите число:0\n",
      "Результат: 11\n"
     ]
    }
   ],
   "source": [
    "string = []\n",
    "number = 1\n",
    "#цикл while повторяет последовательность (запрос числа, запись его в список) до тех пор, пока условие \"переменная number не равно 0\", истино\n",
    "while number != 0:\n",
    "    number = int(input(\"Введите число:\"))\n",
    "    string.append(number)\n",
    "print(\"Результат:\" , sum(string))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задание 3\n",
    "\n",
    "Мы делаем MVP dating-сервиса, и у нас есть список парней и девушек.\n",
    "Выдвигаем гипотезу: лучшие рекомендации мы получим, если просто отсортируем имена по алфавиту и познакомим людей с одинаковыми индексами после сортировки! Но мы не будем никого знакомить, если кто-то может остаться без пары."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Alex и Emma\n",
      "Arthur и Kate\n",
      "John и Kira\n",
      "Peter и Liza\n",
      "Richard и Trisha\n",
      "\n",
      "\n",
      "Brian и Alina\n",
      "Jimmy и Isabella\n",
      "Jon и Jenny\n",
      "Sam и Marina\n",
      "Tobias и Natali\n"
     ]
    }
   ],
   "source": [
    "#Вариант 1, используем кортежи (в данном случае Кортежи не ускорили выполнение задания)\n",
    "boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard']\n",
    "girls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']\n",
    "\n",
    "if len(boys) == len(girls):\n",
    "    \n",
    "        tupple_pairs = zip(sorted(boys), sorted(girls))\n",
    "        \n",
    "        for element in list(tupple_pairs):\n",
    "            print(f\"{element[0]} и {element[1]}\") \n",
    "else:\n",
    "    print(\"Внимание, кто-то может остаться без пары!\")\n",
    "\n",
    "#Вариант 2, только цикл\n",
    "\n",
    "print(\"\\n\")\n",
    "boys2 = ['Jon', 'Sam', 'Tobias', 'Brian', 'Jimmy']\n",
    "girls2 = ['Marina', 'Alina', 'Jenny', 'Natali', 'Isabella']\n",
    "\n",
    "if len(boys) == len(girls):\n",
    "    x=0\n",
    "    boys2 = sorted(boys2) \n",
    "    girls2 = sorted(girls2)\n",
    "    for element in boys: #цикл for, проходим по элементам, выводим параллельно\n",
    "        \n",
    "        print(f\"{boys2[x]} и {girls2[x]}\")\n",
    "        x += 1\n",
    "else:\n",
    "    print(\"Внимание, кто-то может остаться без пары!\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
